RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm7/board/MCUX_Config/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPSPI3Pins, assigned for the Cortex-M7 core.
 * Description   : Configures pin routing for LPSPI3 (GPIO_SD_B1_00..03).
 *                 SCK  -> GPIO_SD_B1_01 (LPSPI3_SCK)
 *                 SOUT -> GPIO_SD_B1_02 (LPSPI3_SDO)
 *                 SIN  -> GPIO_SD_B1_03 (LPSPI3_SDI)
 *                 PCS0 -> GPIO_SD_B1_00 (LPSPI3_PCS0, hardware CS, optional)
 *
 * END ****************************************************************************************************************/
#ifdef BSP_USING_SPI3
void BOARD_InitLPSPI3Pins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc1);
    CLOCK_EnableClock(kCLOCK_Iomuxc2);

    /* LPSPI3_SCK: GPIO_SD_B1_01, high driver */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_LPSPI3_SCK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_01_LPSPI3_SCK, 0x08U);
    /* LPSPI3_SDO (SOUT/MOSI): GPIO_SD_B1_02, high driver + pull-up */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_LPSPI3_SDO, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_LPSPI3_SDO, 0x04U);
    /* LPSPI3_SDI (SIN/MISO): GPIO_SD_B1_03, high driver + pull-up */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_LPSPI3_SDI, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_03_LPSPI3_SDI, 0x04U);
    /* LPSPI3_PCS0 (hardware CS): GPIO_SD_B1_00, high driver */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_LPSPI3_PCS0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_00_LPSPI3_PCS0, 0x08U);
}
#endif /* BSP_USING_SPI3 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCAN3Pins, assigned for the Cortex-M7 core.
 * Description   : Configures pin routing for CAN3.
 *                 TX -> GPIO_AON_18 (CAN3_TX)
 *                 RX -> GPIO_AON_03 (CAN3_RX)
 *
 * END ****************************************************************************************************************/
#ifdef BSP_USING_CAN3
void BOARD_InitCAN3Pins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc1);
    CLOCK_EnableClock(kCLOCK_Iomuxc2);

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AON_18_CAN3_TX,             /* GPIO_AON_18 is configured as CAN3_TX */
        1U);                                    /* Software Input On Field: Force input path */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AON_03_CAN3_RX,             /* GPIO_AON_03 is configured as CAN3_RX */
        1U);                                    /* Software Input On Field: Force input path */
}
#endif /* BSP_USING_CAN3 */

#ifdef BSP_USING_SDIO
void BOARD_InitSDIO1Pins(void)
{
    rgpio_pin_config_t pinCfg;

    CLOCK_EnableClock(kCLOCK_Iomuxc1);
    CLOCK_EnableClock(kCLOCK_Iomuxc2);

    /* SD_PWREN_B: GPIO_AD_14 -> RGPIO4_IO14, output low = card power on */
    pinCfg.pinDirection = kRGPIO_DigitalOutput;
    pinCfg.outputLogic  = 0U;
    RGPIO_PinInit(RGPIO4, 14U, &pinCfg);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_GPIO4_IO14, 0U);

    /* SD1_CD_B: GPIO_AD_15 -> RGPIO4_IO15, input (card detect) */
    pinCfg.pinDirection = kRGPIO_DigitalInput;
    pinCfg.outputLogic  = 0U;
    RGPIO_PinInit(RGPIO4, 15U, &pinCfg);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_GPIO4_IO15, 0U);

    /* VSELECT: GPIO_AD_34 -> GPIO5_IO02, output (voltage select) */
    pinCfg.pinDirection = kRGPIO_DigitalOutput;
    pinCfg.outputLogic  = 0U;
    RGPIO_PinInit(RGPIO5, 2U, &pinCfg);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_34_GPIO5_IO02, 0U);

    /* CMD: high driver, pull-up */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_USDHC1_CMD, 1U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_00_USDHC1_CMD, 0x04U);

    /* CLK: high driver, no pull */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_USDHC1_CLK, 1U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_01_USDHC1_CLK, 0x0CU);

    /* DATA0 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0, 1U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0, 0x04U);

    /* DATA1 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1, 1U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1, 0x04U);

    /* DATA2 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2, 1U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2, 0x04U);

    /* DATA3 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3, 1U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3, 0x04U);
}
#endif /* BSP_USING_SDIO */

#ifdef BSP_USING_ETH
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPhyAccessPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: L17, peripheral: NETC, signal: netc_emdc, pin_signal: GPIO_AD_30, pull_up_down_config: Pull_Down, open_drain: Disable}
  - {pin_num: K17, peripheral: NETC, signal: netc_emdio, pin_signal: GPIO_AD_31, identifier: NETC_ECAT_MDIO, pull_up_down_config: Pull_Down, open_drain: Enable}
  - {pin_num: M15, peripheral: RGPIO4, signal: 'gpio_io, 25', pin_signal: GPIO_AD_25, direction: OUTPUT, pull_up_down_config: Pull_Down}
  - {pin_num: B11, peripheral: RGPIO6, signal: 'gpio_io, 13', pin_signal: GPIO_B1_13, direction: OUTPUT}
  - {pin_num: L16, peripheral: RGPIO4, signal: 'gpio_io, 28', pin_signal: GPIO_AD_28, identifier: ENET2_RST_B, direction: OUTPUT}
  - {pin_num: E10, peripheral: RGPIO6, signal: 'gpio_io, 15', pin_signal: GPIO_B2_01, direction: OUTPUT}
  - {pin_num: N15, peripheral: RGPIO4, signal: 'gpio_io, 13', pin_signal: GPIO_AD_13, direction: OUTPUT}
  - {pin_num: P17, peripheral: RGPIO4, signal: 'gpio_io, 12', pin_signal: GPIO_AD_12, direction: INPUT, gpio_interrupt: no_init, gpio_interrupt_output: no_init, pull_up_down_config: no_init,
    open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPhyAccessPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPhyAccessPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

