RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm7/board/MCUX_Config/pin_mux.c
    /* GPIO configuration of ENET4_INT_B on GPIO_AD_12 (pin P17) */
    rgpio_pin_config_t ENET4_INT_B_config = {
        .pinDirection = kRGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on GPIO_AD_12 (pin P17) */
    RGPIO_PinInit(RGPIO4, 12U, &ENET4_INT_B_config);
    /* Configures GPIO pin interrupt/DMA request on GPIO_AD_12 (pin P17) */
    RGPIO_SetPinInterruptConfig(RGPIO4, 12U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

    /* GPIO configuration of ENET4_RST_B on GPIO_AD_13 (pin N15) */
    rgpio_pin_config_t ENET4_RST_B_config = {
        .pinDirection = kRGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on GPIO_AD_13 (pin N15) */
    RGPIO_PinInit(RGPIO4, 13U, &ENET4_RST_B_config);

    /* GPIO configuration of ENET0_RST_B on GPIO_AD_25 (pin M15) */
    rgpio_pin_config_t ENET0_RST_B_config = {
        .pinDirection = kRGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on GPIO_AD_25 (pin M15) */
    RGPIO_PinInit(RGPIO4, 25U, &ENET0_RST_B_config);

    /* GPIO configuration of ENET2_RST_B on GPIO_AD_28 (pin L16) */
    rgpio_pin_config_t ENET2_RST_B_config = {
        .pinDirection = kRGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on GPIO_AD_28 (pin L16) */
    RGPIO_PinInit(RGPIO4, 28U, &ENET2_RST_B_config);

    /* GPIO configuration of ENET1_RST_B on GPIO_B1_13 (pin B11) */
    rgpio_pin_config_t ENET1_RST_B_config = {
        .pinDirection = kRGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on GPIO_B1_13 (pin B11) */
    RGPIO_PinInit(RGPIO6, 13U, &ENET1_RST_B_config);

    /* GPIO configuration of ENET3_RST_B on GPIO_B2_01 (pin E10) */
    rgpio_pin_config_t ENET3_RST_B_config = {
        .pinDirection = kRGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on GPIO_B2_01 (pin E10) */
    RGPIO_PinInit(RGPIO6, 15U, &ENET3_RST_B_config);

    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_12_GPIO4_IO12,           /* GPIO_AD_12 is configured as GPIO4_IO12 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_13_GPIO4_IO13,           /* GPIO_AD_13 is configured as GPIO4_IO13 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_25_GPIO4_IO25,           /* GPIO_AD_25 is configured as GPIO4_IO25 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_28_GPIO4_IO28,           /* GPIO_AD_28 is configured as GPIO4_IO28 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_30_NETC_EMDC,            /* GPIO_AD_30 is configured as NETC_EMDC */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_31_NETC_EMDIO,           /* GPIO_AD_31 is configured as NETC_EMDIO */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_B1_13_GPIO6_IO13,           /* GPIO_B1_13 is configured as GPIO6_IO13 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_B2_01_GPIO6_IO15,           /* GPIO_B2_01 is configured as GPIO6_IO15 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_12_GPIO4_IO12,           /* GPIO_AD_12 PAD functional properties : */
        0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: high driver
                                                    Pull / Keep Select Field: Pull Enable
                                                    Pull Up / Down Config. Field: Weak pull up
                                                    Open Drain Field: Disabled
                                                    Force ibe off Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_25_GPIO4_IO25,           /* GPIO_AD_25 PAD functional properties : */
        0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: high driver
                                                    Pull / Keep Select Field: Pull Enable
                                                    Pull Up / Down Config. Field: Weak pull down
                                                    Open Drain Field: Disabled
                                                    Force ibe off Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_30_NETC_EMDC,            /* GPIO_AD_30 PAD functional properties : */
        0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: high driver
                                                    Pull / Keep Select Field: Pull Enable
                                                    Pull Up / Down Config. Field: Weak pull down
                                                    Open Drain Field: Disabled
                                                    Force ibe off Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_31_NETC_EMDIO,           /* GPIO_AD_31 PAD functional properties : */
        0x16U);                                 /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: high driver
                                                    Pull / Keep Select Field: Pull Enable
                                                    Pull Up / Down Config. Field: Weak pull down
                                                    Open Drain Field: Enabled
                                                    Force ibe off Field: Disabled */
}


